#### BuiltInFailures.ElementFailures Members

---

|  |
| --- |
| BuiltInFailures ElementFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures ElementFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | FailedToRemoveElement | Element cannot be removed from the solution. The solution is required to have at least two elements to be valid. |
| Public property Static member | NotAllowedToRemoveAllElements | You cannot removed all the elements from current solution. At least there should be two elements in the solution. |
| Public property Static member | SplitElementHasTagsWithoutLeaders | The split element has one or more Tags without Leaders enabled and needs to be checked. |

# See Also

BuiltInFailures ElementFailures Class

Autodesk.Revit.DB Namespace